Public Attributes | List of all members
API_AssemblySegmentData Struct Reference
Element Manager API
Represents an general segment. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_ModelElemStructureType  | modelElemStructureType
The structure type of the column's segment.
API_AttributeIndex  | buildingMaterial
Building Material index of column's hatch. Used only, if structure type is API_BasicStrucure.
bool  | circleBased
Defines whether the column is circular (true) or rectangular/profiled (false).
API_AttributeIndex  | profileAttr
Attribute index of the extruded profile.
short  | profileType
The type of the profile:
bool  | isHomogeneous
double  | nominalWidth
Nominal width of segment.
double  | nominalHeight
Nominal height of segment.
bool  | isWidthAndHeightLinked
State of linking between width and height.
double  | endWidth
Width of end in case of not homogeneous uniformity.
double  | endHeight
Height of end in case of not homogeneous uniformity.
bool  | isEndWidthAndHeightLinked
State of linking between end width and end height in case of not homogeneous uniformity.
double  | relativeHomeStoryLevel
Relative Home Story Level of the segment, should not be interpreted on default, only on instance. Output only parameter.
Detailed Description
Represents an general segment.
Member Data Documentation
◆ buildingMaterial
 API_AssemblySegmentData::buildingMaterial
Building Material index of column's hatch. Used only, if structure type is API_BasicStrucure.
◆ circleBased
 API_AssemblySegmentData::circleBased
Defines whether the column is circular (true) or rectangular/profiled (false).
◆ endHeight
 API_AssemblySegmentData::endHeight
Height of end in case of not homogeneous uniformity.
◆ endWidth
 API_AssemblySegmentData::endWidth
Width of end in case of not homogeneous uniformity.
◆ isEndWidthAndHeightLinked
 API_AssemblySegmentData::isEndWidthAndHeightLinked
State of linking between end width and end height in case of not homogeneous uniformity.
◆ isHomogeneous
 bool API_AssemblySegmentData::isHomogeneous
◆ isWidthAndHeightLinked
 API_AssemblySegmentData::isWidthAndHeightLinked
State of linking between width and height.
◆ modelElemStructureType
 API_AssemblySegmentData::modelElemStructureType
The structure type of the column's segment.
◆ nominalHeight
 API_AssemblySegmentData::nominalHeight
Nominal height of segment.
◆ nominalWidth
 API_AssemblySegmentData::nominalWidth
Nominal width of segment.
◆ profileAttr
 API_AssemblySegmentData::profileAttr
Attribute index of the extruded profile.
◆ profileType
 API_AssemblySegmentData::profileType
The type of the profile:
◆ relativeHomeStoryLevel
 API_AssemblySegmentData::relativeHomeStoryLevel
Relative Home Story Level of the segment, should not be interpreted on default, only on instance. Output only parameter.